<h1>1. kbo 승률 테이블 만들기

In [9]:
import pandas as pd
import numpy as np
kbo = {'year': [2013, 2014, 2015, 2016],
      'nexen': [0.571, 0.619, 0.545, 0.538],
      'lotte': [0.532, 0.547, 0.462, 0.458],
      'KT': [np.NaN, np.NaN, 0.364, 0.418]}

In [10]:
#kbo 테이블 확인
kbo

{'year': [2013, 2014, 2015, 2016],
 'nexen': [0.571, 0.619, 0.545, 0.538],
 'lotte': [0.532, 0.547, 0.462, 0.458],
 'KT': [nan, nan, 0.364, 0.418]}

In [12]:
#col_list와 index_list 생성하여 pandas의 dataframe 만들기
col_list = ['year', 'nexen', 'lotte', 'KT']
index_list = ['2013', '2014', '2015', '2016']
df_kbo = pd.DataFrame(kbo, columns=col_list, index = index_list)
df_kbo

      year  nexen  lotte     KT
2013  2013  0.571  0.532    NaN
2014  2014  0.619  0.547    NaN
2015  2015  0.545  0.462  0.364
2016  2016  0.538  0.458  0.418

In [14]:
df_kbo.head(3)

      year  nexen  lotte     KT
2013  2013  0.571  0.532    NaN
2014  2014  0.619  0.547    NaN
2015  2015  0.545  0.462  0.364

In [15]:
#[1:2]의 의미: 1이상 2미만
df_kbo[1:2]

      year  nexen  lotte  KT
2014  2014  0.619  0.547 NaN

In [19]:
#loc 기능을 이용하여 데이터 출력
df_kbo.loc['2013':'2016']

      year  nexen  lotte     KT
2013  2013  0.571  0.532    NaN
2014  2014  0.619  0.547    NaN
2015  2015  0.545  0.462  0.364
2016  2016  0.538  0.458  0.418

In [21]:
#column 이름으로 데이터 출력
df_kbo['lotte']

2013    0.532
2014    0.547
2015    0.462
2016    0.458
Name: lotte, dtype: float64

In [23]:
df_kbo['lotte']['2014':'2016']

2014    0.547
2015    0.462
2016    0.458
Name: lotte, dtype: float64

<h1>2. 데이터 통합하기 (join, merge)

In [26]:
# df1 데이터프레임 생성
df1 = pd.DataFrame({'class1': [45, 47, 35, 23],
                   'class2': [30 , 35, 26, 84]})
df1

   class1  class2
0      45      30
1      47      35
2      35      26
3      23      84

In [28]:
# df2 데이터프레임 생성
df2 = pd.DataFrame({'class1': [100, 200],
                   'class2': [300, 400]})
df2

   class1  class2
0     100     300
1     200     400

In [33]:
df1.append(df2)

   class1  class2
0      45      30
1      47      35
2      35      26
3      23      84
0     100     300
1     200     400

In [34]:
#ignore_index = True: index값을 넣으면 index값이 하나의 테이블처럼 쭉 나열된다.
df1.append(df2, ignore_index=True)

   class1  class2
0      45      30
1      47      35
2      35      26
3      23      84
4     100     300
5     200     400

In [35]:
df3=pd.DataFrame({'class1': [48, 39]})
df3

   class1
0      48
1      39

In [38]:
#df3은 class2 값이 없기 때문에 NaN처리됨
df2.append(df3, ignore_index=True)

   class1  class2
0     100   300.0
1     200   400.0
2      48     NaN
3      39     NaN

In [39]:
df4 = pd.DataFrame({'class4': [45, 47, 35, 60]})

In [41]:
#df1을 기준으로 df4 join
df1.join(df4)

   class1  class2  class4
0      45      30      45
1      47      35      47
2      35      26      35
3      23      84      60

In [43]:
index_label = ['a', 'b', 'c', 'd']
df1a = pd.DataFrame({'class1': [34, 25, 34, 62],
                   'class2': [23, 23, 62, 34]}, index=index_label)
df4b = pd.DataFrame({'class3': [43, 41, 42, 68]}, index=index_label)
df1a

   class1  class2
a      34      23
b      25      23
c      34      62
d      62      34

In [45]:
df1a.join(df4b)

   class1  class2  class3
a      34      23      43
b      25      23      41
c      34      62      42
d      62      34      68

In [47]:
df5 = pd.DataFrame({'class4': [42, 47]})
df5

   class4
0      42
1      47

In [52]:
df1.join(df5)

   class1  class2  class4
0      45      30    42.0
1      47      35    47.0
2      35      26     NaN
3      23      84     NaN

<h3> 1) merge

In [51]:
df_6 = pd.DataFrame({'date':['Sep', 'Oct', 'Nov', 'Dec'],
                   'Pd.A': [120, 167, 214, 209],
                   'Pd.B': [30, 140, 398, 281]})
df_6

  date  Pd.A  Pd.B
0  Sep   120    30
1  Oct   167   140
2  Nov   214   398
3  Dec   209   281

In [57]:
df_7 = pd.DataFrame({'date':['Sep', 'Oct', 'Nov', 'Dec'],
                   'Pd.C': [134, 123, 253, 505],
                   'Pd.D': [95, 140, 533, 200]})
df_6.merge(df_7)

  date  Pd.A  Pd.B  Pd.C  Pd.D
0  Sep   120    30   134    95
1  Oct   167   140   123   140
2  Nov   214   398   253   533
3  Dec   209   281   505   200

<h3> 2) key값으로 묶기

In [56]:
df_left = pd.DataFrame({'key':['A', 'B', 'C'], 'left':[1,2,3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [60]:
df_right = pd.DataFrame({'key':['A', 'B', 'D'], 'right':[4,5,6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [67]:
#left를 기준으로 left 양식으로 붙이기
#how = 'left'
df_left.merge(df_right, how='left', on='key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [66]:
#left를 기준으로 right 양식으로 붙이기
#how = 'right'
df_left.merge(df_right, how='right', on='key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [63]:
#left를 기준으로 outer 양식으로 붙이기
#how = 'outer'
df_left.merge(df_right, how='outer', on='key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [64]:
#left를 기준으로 inner 양식으로 붙이기
#how = 'onner'
df_left.merge(df_right, how='inner', on='key')

  key  left  right
0   A     1      4
1   B     2      5